packages/windmapper/windmapper-2.1.7-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.7.data/data/share/windninja/ninjafoam/2.2.0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 50;

boundaryField
{
$boundaryField$    
    minZ
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    maxZ
    {
        type          zeroGradient;
    }
}


// ************************************************************************* //
